{
  "backend/main.mo": "Main ICP actor implementing user profile management, subscription tracking, and ICP ledger payment verification with role-based access control (guest/user/admin) and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting a single completed feature: updating the Block Index input field in SubscriptionPage.tsx to display a descriptive label about the ICP ledger transaction index.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, serving as a reference index for the project's React/TypeScript frontend components, pages, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.) using OKLCH values.",
  "frontend/index.html": "Minimal HTML shell for the React SPA titled 'Oisy-like Crypto Wallet', mounting the app at `#root` and loading the TypeScript entry point.",
  "frontend/src/App.tsx": "Root React app using TanStack Router with an AuthLayout guard that enforces authentication, subscription checks (redirecting unsubscribed users to `/subscription`), whitelist migration on startup, and routes for all wallet pages.",
  "frontend/src/components/GlassCard.tsx": "Reusable glassmorphism card component accepting optional `style`, `raised`, `hover`, and `onClick` props with dark-theme CSS class variants.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button component using Internet Identity, showing a loading spinner during authentication and clearing the React Query cache on logout.",
  "frontend/src/components/Navbar.tsx": "Sticky navigation header rendering all app nav links (including Subscription with a Shield icon) for both desktop and mobile menus, with a user avatar dropdown showing the principal and profile initials.",
  "frontend/src/components/UserProfileSetup.tsx": "A modal dialog component that prompts new users to enter a display name and saves it via the `useSaveCallerUserProfile` mutation to complete wallet onboarding.",
  "frontend/src/components/WalletAddressCard.tsx": "A card component that displays a truncated wallet address (ICP or EVM) with a tooltip showing the full address and a copy-to-clipboard button.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` and `useInternetIdentity` hook that manage Internet Identity authentication state, including login, logout, and persisting identity across page reloads via `AuthClient`.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for backend interactions including user profile CRUD, subscription status checks, payment recording, and subscription verification with result parsing.",
  "frontend/src/index.css": "Global stylesheet that defines Tailwind base/component/utility layers, OKLCH-based CSS custom properties for a dark-first wallet theme, and reusable component classes like `glass-card`, `teal-glow`, and `btn-primary`.",
  "frontend/src/lib/walletStorage.ts": "Defines TypeScript interfaces and localStorage utilities for wallet data including networks, tokens, transactions, watchlist, and whitelist entries. Also provides address validation functions for ICP native, ICP token, and EVM addresses, plus default network configurations.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page displaying the user's ICP and EVM wallet addresses, a mock portfolio summary with total estimated value, and lists of native token balances and ERC-20 tokens loaded from storage.",
  "frontend/src/pages/LoginPage.tsx": "Landing/login page with a hero background, feature highlights, and a call-to-action using the LoginButton component for Internet Identity authentication.",
  "frontend/src/pages/NetworksPage.tsx": "Networks page that lists all configured networks as cards, showing the user's derived address per network and any ERC-20 tokens added for EVM networks.",
  "frontend/src/pages/SendPage.tsx": "Multi-step send transaction page supporting ICP (native and token) and EVM networks, with address validation, whitelist picker, confirmation step, and transaction record saving.",
  "frontend/src/pages/SubscriptionPage.tsx": "Renders the subscription management page where users can pay ICP to subscribe, view their subscription status (active/pending/expired), and verify/activate their subscription by submitting a block index.",
  "frontend/src/pages/TokensPage.tsx": "Provides a CRUD interface for managing custom ERC-20 tokens on EVM networks, allowing users to add, edit balances, and delete tokens stored via walletStorage.",
  "frontend/src/pages/TransactionHistoryPage.tsx": "Displays a searchable list of recorded transaction intents with status badges, and supports deleting individual records or clearing all transaction history.",
  "frontend/src/pages/WatchlistPage.tsx": "Manages a watchlist of blockchain addresses with labels and balances, supporting add, delete, copy, and mock-refresh operations persisted per Internet Identity principal.",
  "frontend/src/pages/WhitelistPage.tsx": "Provides a CRUD interface for a whitelist of labeled addresses supporting ICP native, ICP token, and EVM address types with per-type validation and copy functionality.",
  "frontend/src/utils/addressDerivation.ts": "Exports utility functions to derive an ICP address (principal text) and a deterministic EVM address (SHA-256 of principal bytes, last 20 bytes) from a principal, plus a truncation helper for display.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH-based color palette, typography, container queries, animations, and box shadows for a dark crypto wallet UI.",
  "project_state.json": "Project state tracking file describing a multi-chain ICP crypto wallet DApp with Internet Identity auth, ERC20 management, subscription payments via ICP Ledger block verification, and a known bug in backend block parsing logic."
}