{
  "backend/main.mo": "Main ICP actor implementing user profile management, subscription tracking (with payment recording and verification against the ICP ledger), and blob storage/authorization mixins with role-based access control.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose and key changes, serving as a high-level reference for the frontend codebase.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "Minimal HTML shell for the React SPA, mounting the app into a `#root` div and loading the TypeScript entry point.",
  "frontend/src/App.tsx": "Root app file configuring TanStack Router with an AuthLayout guard that checks authentication, subscription status, and triggers whitelist migration, redirecting unsubscribed users to `/subscription`.",
  "frontend/src/components/GlassCard.tsx": "Reusable glassmorphism card component supporting optional `style`, `raised`, `hover`, and `onClick` props with dark-theme CSS class variants.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button component using Internet Identity, showing a loading spinner during authentication and clearing React Query cache on logout.",
  "frontend/src/components/Navbar.tsx": "Sticky navigation header rendering all app nav links (including Subscription with a Shield icon) for desktop and mobile, with a user avatar dropdown showing the principal and profile initials.",
  "frontend/src/components/UserProfileSetup.tsx": "A modal dialog component that prompts new users to enter a display name and saves it via the `useSaveCallerUserProfile` mutation to complete wallet onboarding.",
  "frontend/src/components/WalletAddressCard.tsx": "A card component that displays a truncated wallet address (ICP or EVM) with a tooltip showing the full address and a copy-to-clipboard button.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` and `useInternetIdentity` hook that manage Internet Identity authentication state, including login, logout, and persisting identity across page reloads via `AuthClient`.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for backend interactions including user profile CRUD, subscription status checks, payment recording, and subscription verification with result parsing.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/component/utility layers, OKLCH-based CSS custom properties for dark-first theming, and reusable component classes like `glass-card`, `teal-glow`, and `btn-primary`.",
  "frontend/src/lib/walletStorage.ts": "Defines TypeScript interfaces and localStorage utilities for wallet data including networks, tokens, transactions, watchlist, and whitelist entries. Also provides address validation functions for ICP native, ICP token, and EVM formats, plus default network configurations.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page that displays the user's derived ICP and EVM wallet addresses, a mock portfolio summary with total value, and lists of native tokens and ERC-20 tokens loaded from storage.",
  "frontend/src/pages/LoginPage.tsx": "Landing/login page with a hero background, branding, feature highlights, and a login CTA button powered by Internet Identity authentication.",
  "frontend/src/pages/NetworksPage.tsx": "Networks page that lists all configured networks as cards, showing the user's derived address per network and any ERC-20 tokens added for EVM networks.",
  "frontend/src/pages/SendPage.tsx": "Multi-step send transaction page supporting ICP (native and token) and EVM networks, with form validation, whitelist address picker, confirmation step, and transaction record saving.",
  "frontend/src/pages/SubscriptionPage.tsx": "Renders the subscription management page where users can view their subscription status (active/pending/expired), pay via ICP transfer to a treasury account, and verify/activate their subscription by submitting a block index.",
  "frontend/src/pages/TokensPage.tsx": "Provides a CRUD interface for managing custom ERC-20 tokens on EVM networks, allowing users to add, edit balances, and delete tokens stored via walletStorage.",
  "frontend/src/pages/TransactionHistoryPage.tsx": "Displays a searchable list of recorded transaction intents with status badges, and supports deleting individual records or clearing all transaction history.",
  "frontend/src/pages/WatchlistPage.tsx": "Manages a watchlist of blockchain addresses per network, supporting add, delete, copy, and mock-refresh of balances, persisted per Internet Identity principal.",
  "frontend/src/pages/WhitelistPage.tsx": "Provides a CRUD interface for managing a whitelist of trusted addresses (ICP native, ICP token, or EVM), with type-specific validation and copy-to-clipboard support.",
  "frontend/src/utils/addressDerivation.ts": "Exports utility functions to derive an ICP address and a deterministic EVM address from a Principal text, plus a helper to truncate addresses for display.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH-based color palette, typography/container-query plugins, custom fonts, shadows, border radii, and keyframe animations.",
  "project_state.json": "Project state tracking file describing a crypto wallet DApp on Internet Computer with features like Internet Identity auth, multi-chain asset viewing, ERC20 management, and ICP subscription payments, including known issues and existing feature inventory."
}