{
  "backend/main.mo": "Main Motoko actor that composes blob storage and authorization mixins, and provides user profile CRUD operations (save/get) gated by access control permissions.",
  "feature_evidence.json": "Feature evidence report mapping two wallet address features (dashboard display and send/networks pre-population) to their implementing source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of each frontend source file, serving as a reference index for the project's frontend modules.",
  "frontend/index.css": "Global stylesheet importing Tailwind directives and defining CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "HTML entry point for the React app titled 'Oisy-like Crypto Wallet', mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with an authenticated layout guard (redirects unauthenticated users to LoginPage), defines all page routes, and integrates the UserProfileSetup modal.",
  "frontend/src/components/GlassCard.tsx": "Reusable glassmorphism card component supporting optional raised, hover, and click variants with customizable className and inline style props.",
  "frontend/src/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, showing a loading spinner during authentication and clearing the React Query cache on logout.",
  "frontend/src/components/Navbar.tsx": "Sticky top navigation bar with logo, desktop nav links for all wallet pages, a mobile menu, and a user avatar dropdown showing the principal or profile name.",
  "frontend/src/components/UserProfileSetup.tsx": "Modal dialog that prompts newly authenticated users to enter a display name and saves it via the saveCallerUserProfile mutation before they can proceed.",
  "frontend/src/components/WalletAddressCard.tsx": "A React card component that displays a labeled wallet address (truncated) with a tooltip showing the full address and a copy-to-clipboard button with toast feedback.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage ICP AuthClient lifecycle, persisting and exposing the user's identity along with login/logout status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and saving the caller's user profile via the backend actor, plus a useLocalStorage helper for persisting wallet data (networks, tokens, etc.) keyed by principal.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines dark-first OKLCH CSS custom properties for theming along with utility component classes like glass-card and teal-glow.",
  "frontend/src/lib/walletStorage.ts": "Defines TypeScript interfaces and localStorage read/write helpers for wallet data (networks, tokens, watchlist, transactions), including default network configurations and utility functions for ID generation and address formatting.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/DashboardPage.tsx": "The main dashboard page that derives and displays ICP and EVM wallet addresses from the user's Internet Identity, alongside a mock portfolio summary with token balances and recent activity.",
  "frontend/src/pages/LoginPage.tsx": "Landing/login page for NexWallet featuring a hero background, feature highlights (security, multi-chain, speed, self-custody), and a centered CTA with a LoginButton component.",
  "frontend/src/pages/NetworksPage.tsx": "Displays supported blockchain networks (ICP, Ethereum, BSC, Polygon, Arbitrum) and shows the user's derived ICP or EVM address for each network with copy-to-clipboard functionality.",
  "frontend/src/pages/SendPage.tsx": "Multi-step send transaction form (form → confirm → success) that derives the user's from-address based on selected network, validates inputs, simulates submission, and saves records to localStorage.",
  "frontend/src/pages/TokensPage.tsx": "Manages a user's custom ERC-20 token list stored via walletStorage, supporting add (with validation), delete, search, and copy-address actions through dialog/alert-dialog UI components.",
  "frontend/src/pages/TransactionHistoryPage.tsx": "Shows the user's transaction history loaded from walletStorage with filtering by status and search, and supports deleting individual records or clearing all history.",
  "frontend/src/pages/WatchlistPage.tsx": "React page for managing a watchlist of wallet addresses, supporting add/delete/refresh operations with form validation, clipboard copy, and persistent storage via walletStorage utilities.",
  "frontend/src/utils/addressDerivation.ts": "Provides utility functions to derive ICP and EVM addresses from a Principal (EVM via SHA-256 hash), plus a helper to truncate addresses for display.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routes, with sessionStorage persistence helpers and a function to remove parameters from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, OKLCH-based color tokens (teal, surface, wallet), shadows, border radii, and animation keyframes, with typography, container-queries, and animate plugins.",
  "project_state.json": "Project state manifest (version 5) describing the ICP-based crypto wallet DApp's architecture, implemented features (auth, multi-chain overview, ERC-20 management, watchlist, send flow, dark theme), and build metadata."
}