{
  "kind": "build_request",
  "title": "Fix verifyAndActivateSubscription block parsing logic in backend",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-32",
      "text": "Fix the `verifyAndActivateSubscription` function in `backend/main.mo` so that it correctly detects and validates ICP transfer operations in a given block. The current implementation returns 'Block does not contain a transfer operation' even when a valid ICP transfer exists in the block. Specifically: (1) Review the ICP Ledger `query_blocks` response structure and ensure the block's transaction type field is accessed by the correct field name — the ICP Ledger returns blocks with a `transaction` field containing an `operation` variant that may be `#Transfer`, `#Mint`, `#Burn`, or `#Approve`; the code must match the exact Motoko variant tag used in the decoded response. (2) Ensure the inter-canister call to the ICP Ledger canister (`ryjl3-tyaaa-aaaaa-aaaba-cai`) uses the correct method (`query_blocks`) and the request/response types are fully and correctly typed in the Motoko actor type definition — missing or misnamed fields in the type annotation cause silent decoding failures that make operation fields appear absent. (3) Verify that the destination account comparison correctly converts the canister's treasury Account ID (derived from the canister's own principal) to the same binary/text format used in the ledger block's `to` field. (4) Confirm the amount threshold check uses `>= 100_000` e8s (0.001 ICP). (5) Add descriptive error variants so failures return meaningful messages such as 'Block not found', 'Transfer amount insufficient', 'Wrong destination address', or 'Already subscribed' instead of the generic 'Block does not contain a transfer operation'.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Block does not contain a transfer operation.",
          "说明验证时有问题，并没有检测到转账交易"
        ]
      },
      "acceptanceCriteria": [
        "After a user sends exactly 0.001 ICP (100,000 e8s) to the treasury address and obtains the block index, calling `verifyAndActivateSubscription(blockIndex)` with that block index succeeds and marks the subscription as active.",
        "The function correctly identifies a `#Transfer` operation in the ICP Ledger block response without returning 'Block does not contain a transfer operation'.",
        "The ICP Ledger inter-canister type definition in main.mo includes all required fields for the `QueryBlocksResponse`, `Block`, `Transaction`, and `Operation` types with correct Motoko field names.",
        "The treasury account ID comparison in the verification logic uses a consistent format matching what the ICP Ledger stores as the `to` field.",
        "Amount check verifies the transfer amount is >= 100,000 e8s before marking the subscription active.",
        "Failure cases return descriptive error strings: 'Block not found', 'Transfer amount insufficient', 'Wrong destination address', 'Subscription already active'.",
        "Existing `recordPayment` function is not broken by this change."
      ]
    }
  ],
  "constraints": [
    "Do not change the subscription fee threshold — it must remain 100,000 e8s (0.001 ICP).",
    "Do not modify any frontend immutable paths.",
    "The ICP Ledger canister ID must remain `ryjl3-tyaaa-aaaaa-aaaba-cai`.",
    "The existing `recordPayment` function must be preserved for backward compatibility."
  ],
  "nonGoals": [
    "Do not change any frontend UI components or pages as part of this fix.",
    "Do not implement a new subscription flow or change the Plan A UX.",
    "Do not add new backend functions unrelated to the block verification fix."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}