{
  "kind": "build_request",
  "title": "Display user's own ICP and EVM wallet addresses after login",
  "projectName": "NexWallet",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-8",
      "text": "After a user logs in via Internet Identity, derive and display their ICP account address (Account ID / principal-based address) and a deterministic EVM-compatible wallet address (derived from the user's principal). Show both addresses prominently on the Dashboard page in clearly labeled cards with copy-to-clipboard buttons, so the user knows where to receive tokens.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "id登录后可以查看自己的icp和evm钱包地址，保证可以接收和发送代币"
        ]
      },
      "acceptanceCriteria": [
        "After logging in with Internet Identity, the Dashboard displays a dedicated 'Your Wallet Addresses' section.",
        "The ICP account address (derived from the authenticated principal) is displayed with a 'ICP Address' label and a copy-to-clipboard button.",
        "An EVM-compatible address (deterministically derived from the principal, e.g., by hashing the principal bytes and taking the last 20 bytes as a 0x-prefixed hex string) is displayed with an 'EVM Address' label and a copy-to-clipboard button.",
        "Both addresses are displayed in full or with a truncated-with-tooltip format for readability.",
        "Clicking the copy button copies the full address to clipboard and shows a brief confirmation toast.",
        "The section is only visible when the user is authenticated; unauthenticated users see the login prompt.",
        "The addresses are consistent across page reloads for the same logged-in principal."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Pre-populate the 'Send' form's sender address fields and the Networks page's associated address column with the user's derived ICP and EVM addresses so they are consistently used across the app as the user's own send-from addresses.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "保证可以接收和发送代币"
        ]
      },
      "acceptanceCriteria": [
        "On the Networks page, the user's ICP address is shown as the associated address for ICP/Internet Computer network rows, and the EVM address is shown for Ethereum/EVM network rows.",
        "On the Send page, the 'From' address is automatically populated with the corresponding derived address based on the selected network/chain.",
        "The derived addresses displayed in all locations are identical to those shown on the Dashboard's 'Your Wallet Addresses' section."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Address derivation must be purely client-side using the authenticated principal — no external RPC or blockchain call is required for address generation.",
    "EVM address derivation must be deterministic and reproducible from the same principal."
  ],
  "nonGoals": [
    "Actual on-chain signing or broadcasting of transactions.",
    "Fetching live token balances from RPC endpoints.",
    "Generating new private keys or mnemonics for users.",
    "Integrating MetaMask or any external wallet provider."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}