{
  "kind": "build_request",
  "title": "Update subscription verification UI to clarify Block Index input label",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-35",
      "text": "In frontend/src/pages/SubscriptionPage.tsx, update the Block Index input field so that its label, placeholder, and helper text clearly read 'The index of the transaction in the ICP ledger.' (or equivalent user-friendly wording derived from that phrase). Replace any label text that previously said 'Block Index' with this descriptive label so users understand exactly what value to enter after completing their ICP transfer.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "如何改成\"The index of the transaction in the ICP ledger.\"来验证交易",
          "交易记录里只有The index of the transaction in the ICP ledger."
        ]
      },
      "acceptanceCriteria": [
        "The Block Index input field on SubscriptionPage.tsx displays the label text 'The index of the transaction in the ICP ledger.' (or a clearly derived equivalent such as 'Transaction Index in ICP Ledger').",
        "Any previous plain 'Block Index' label text is replaced with the new descriptive label.",
        "Helper text or a tooltip beneath the input clarifies that this value can be found in the user's ICP wallet transaction history (e.g. NNS App, ICP Dashboard).",
        "The input still accepts a numeric value (the transaction/block index), and the 'Verify & Activate' button behavior is unchanged.",
        "The visual style matches the existing dark fintech glassmorphism theme."
      ]
    }
  ],
  "constraints": [
    "Do not change the backend verifyAndActivateSubscription function signature or logic — it still accepts a block index (Nat/bigint).",
    "Do not modify any immutable frontend paths (useInternetIdentity.ts, useActor.ts, main.tsx, components/ui)."
  ],
  "nonGoals": [
    "Switching the verification mechanism from block index to transaction hash.",
    "Changes to the backend Motoko actor.",
    "Changes to any other pages or components outside SubscriptionPage.tsx."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}